# vsoSetEventResult

## Description
```pascal
PROCEDURE vsoSetEventResult(inEventResult : LONGINT);
```

```python

def vs.vsoSetEventResult(inEventResult):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inEventResult|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events